RIET/src/Catalogs/Customs/Customs.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Customs</name>
  <attributes>
    <name>LawsonContractor</name>
    <type>
      <types>CatalogRef.КонтрагентыLawson</types>
    </type>
  </attributes>
  <attributes>
    <name>Sakhalin</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>TaxCode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>NamesForLoading</name>
    <attributes>
      <name>NameForLoading</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

RIET/src/Catalogs/Customs/ManagerModule.bsl
Функция ПолучитьПоКоду(Код) Экспорт
	
	// Получает Customs по коду
	// В отличие от стандартной функции отсекаются помеченные на удаление элементы
	// Рекомендуется вызывать из модуля с повторным использованием значений
	
	Возврат РГСофт.НайтиСсылку("Справочник", "Customs", "Код", Код);
	
КонецФункции

Функция ПолучитьПоNameForLoading(NameForLoading) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CustomsNamesForLoading.Ссылка КАК Customs
	|ИЗ
	|	Справочник.Customs.NamesForLoading КАК CustomsNamesForLoading
	|ГДЕ
	|	CustomsNamesForLoading.NameForLoading = &NameForLoading
	|	И НЕ CustomsNamesForLoading.Ссылка.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("NameForLoading", NameForLoading);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда 
	    Возврат Выборка.Customs;
	КонецЕсли;	
	
	Возврат Неопределено;	
	
КонецФункции
